config/cf/Catalogs/ДействияZabbix.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ДействияZabbix</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КлючДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполняемыйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя параметра</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение параметра</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоСписок</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выражение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияСписочныхПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Catalogs/ДействияZabbix/Ext/ObjectModule.bsl
// Выполнение действия объекта
// 
// Параметры:
//  ДополнительныеПараметры - Структура - дополнительные параметры метрики, полученные из JSON-а.
//
// Возвращаемое значение
//  РезультатДейстия - Булево/Строка - результат выполнения действия. 
// 	При успешном выполнении - Истина, при неуспешном - Ложь, при возникновении ошибки - текст ошибки.
//
Функция ВыполнитьДействие(ДополнительныеПараметры) Экспорт
	РезультатДейстия = Ложь;
	
	// Подготовка параметров
	СтруктураПараметров = Новый Структура;
	Для Каждого ПараматерЗапроса ИЗ ПараметрыЗапроса Цикл
		ИмяПараметра = ПараматерЗапроса.Имя;
		ЗначениеПараметра = "";
		Если ПараматерЗапроса.ЭтоСписок Тогда
			ЗначениеПараметра = СформироватьСписокЗначений(ИмяПараметра);
		ИначеЕсли НЕ ПустаяСтрока(ПараматерЗапроса.Выражение) Тогда
			Выполнить(ПараматерЗапроса.Выражение);
		Иначе
			ЗначениеПараметра = ПараматерЗапроса.Значение;
		КонецЕсли;
		СтруктураПараметров.Вставить(ИмяПараметра, ЗначениеПараметра);
	КонецЦикла;
	
	// Подготовка дополнительных параметров
	Если ДополнительныеПараметры <> Неопределено Тогда	
		Для Каждого ДопПараметр Из ДополнительныеПараметры Цикл
			СтруктураПараметров.Вставить(ДопПараметр.Ключ, ДопПараметр.Значение);	
		КонецЦикла;	
	КонецЕсли;
	
	// Подстановка параметров в код
	КодДляВыполнения = ИсполняемыйКод;
	Для Каждого ПараматерЗапроса Из ПараметрыЗапроса Цикл
		ПараметрДляЗамены = "[" + ПараматерЗапроса.Имя + "]";
		ПараметрЗначение = "СтруктураПараметров." + ПараматерЗапроса.Имя;
		КодДляВыполнения = СтрЗаменить(КодДляВыполнения, ПараметрДляЗамены, ПараметрЗначение);
	КонецЦикла;
	
	// Выполнение кода
	Попытка
		Выполнить(КодДляВыполнения);
	Исключение
		РезультатДействия = ОписаниеОшибки();	
	КонецПопытки;
	
	Возврат РезультатДействия;
	
КонецФункции

// Формирует список значений переданного параметра
//  
// Параметры:
//  ИмяПараметра - Строка - имя параметра, списочное значение которого необходимо получить.
//
// Возвращаемое значение
//  СписокЗначений - СписокЗначений - список значений параметра.
//
Функция СформироватьСписокЗначений(ИмяПараметра) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДействияZabbixЗначенияСписочныхПараметров.Значение КАК Значение
		|ИЗ
		|	Справочник.ДействияZabbix.ЗначенияСписочныхПараметров КАК ДействияZabbixЗначенияСписочныхПараметров
		|ГДЕ
		|	ДействияZabbixЗначенияСписочныхПараметров.ИмяПараметра = &ИмяПараметра
		|	И ДействияZabbixЗначенияСписочныхПараметров.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ИмяПараметра", ИмяПараметра);
	
	РезультатЗапроса = Запрос.Выполнить();
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Значение"));
	Возврат СписокЗначений;	
	
КонецФункции
